Autodesk.Navisworks.Api.Plugins.InterfaceRecord
Record that declares a plugin implements a particular interface or behaviour.

Autodesk.Navisworks.Api.Plugins.InterfaceRecord.DeveloperId
The 4 character ADN developer code or a GUID. The combination of this and Name is used
to form Id that identifies which interface is being supported.

Autodesk.Navisworks.Api.Plugins.InterfaceRecord.DisplayName
Optional additional information about the interface implementation

Autodesk.Navisworks.Api.Plugins.InterfaceRecord.Id
The full identifier of the interface being supported. This is formed as
Name.DeveloperId

Autodesk.Navisworks.Api.Plugins.InterfaceRecord.Name
The name of the Inteface. The combination of this and DeveloperId is used
to form Id that identifies which interface is being supported.

Autodesk.Navisworks.Api.Plugins.InterfaceRecord.UserData
Optional additional information about the interface implementation